posts/Virtualization/live migration stop&copy.org
#+TITLE:  The Stop & Copy Phase in QEMU Live Migration
#+DATE: Jul 16, 2019
#+OPTIONS: toc:1

* Setup
This trace is obtained QEMU simple tracing backend.  The guest is assigned 4
VCPUs, 8 GB memory, a virtio nic and a virtio block device.  The guest
runs Ubuntu 18.04.2 and is idle when the TCP migration is performed.

The trace events I used are provided in Appendix A.  The detailed
The trace events are in Appendix Atracing results are in Appendix B.
* Analysis
Operations sorted by time:
| Index | Operations              | Time (us) |
|-------+-------------------------+-----------|
|     5 | send dirty RAM          | 61805.705 |
|    49 | save virtio-blk         |  2030.198 |
|    48 | save virtio-net         |  2029.208 |
|     2 | VM state change notify  |  1083.087 |
|    46 | save piix4_pm           |   675.355 |
|     4 | get dirty RAM log       |   446.159 |
|     3 | get CPU states from KVM |   421.595 |
|     9 | save cpu                |   297.233 |
|     1 | stop all VCPUs          |   221.704 |
|    19 | save cpu                |   173.444 |
|    13 | save cpu                |   172.909 |
|    16 | save cpu                |   166.661 |
|    42 | save vmmouse            |   133.532 |
|    44 | save ide                |    90.513 |
|    51 | save globalstate        |    64.848 |
|    38 | save fdc                |    62.999 |
|    29 | save vga                |    38.811 |
|    26 | save i8259              |    29.543 |
|    10 | save kvm-tpr-opt        |    27.977 |
|    30 | save hpet               |     24.44 |
|    11 | save apic               |    24.086 |
|     7 | save slirp              |    23.166 |
|    14 | save apic               |    21.979 |
|     6 | save timer              |    21.874 |
|    32 | save i8254              |    21.746 |
|    17 | save apic               |    21.214 |
|    20 | save apic               |    20.963 |
|    31 | save mc146818rtc        |    19.784 |
|    34 | save dma                |    18.103 |
|    28 | save ioapic             |    15.085 |
|    35 | save dma                |    14.851 |
|    40 | save ps2mouse           |    14.804 |
|    25 | save PIIX3              |    14.187 |
|    27 | save i8259              |     14.13 |
|    39 | save ps2kbd             |    13.944 |
|    36 | save serial             |    12.588 |
|     8 | save ~cpu_common~       |    11.444 |
|    24 | save I440FX             |    11.056 |
|    21 | save kvmclock           |    10.603 |
|    37 | save ~parallel_isa~     |     9.287 |
|    22 | save ~fw_cfg~           |     9.055 |
|    23 | save PCIBUS             |     8.083 |
|    47 | save smbus-eeprom       |     7.265 |
|    41 | save pckbd              |     7.067 |
|    33 | save pcspk              |     6.665 |
|    50 | save acpi_build         |     5.224 |
|    45 | save i2c_bus            |     4.938 |
|    43 | save port92             |     4.633 |
|    12 | save ~cpu_common~~      |       4.5 |
|    18 | save ~cpu_common~       |     4.242 |
|    15 | save ~cpu_common~       |     4.188 |

- The time of RAM-related operations (get dirty log, send to remote)
  may be reduced by
  1. Enabling compression.  [TODO] will compression works for the
     stop&copy phase?
  2. Setting max downtime limit.  This will affect the decision of
     when to stop the iteration phase and to enter the final stop&copy
     phase.
- Saving some of the devices takes a lot time: is it due to network
  transmission?
- Most VM states can be saved/transmitted at round tens of
  micro-seconds with a few exceptions that take thousands.
