posts/Virtualization/live migration stop&copy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Stop &amp; Copy Phase in QEMU Live Migration</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">The Stop &amp; Copy Phase in QEMU Live Migration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org81beed0">1. Setup</a></li>
<li><a href="#org2f762c2">2. Analysis</a></li>
<li><a href="#org2d7da8e">3. Appendix A: Probed tracing events</a></li>
<li><a href="#org0cd562f">4. Appendix B: Tracing result</a></li>
</ul>
</div>
</div>

<div id="outline-container-org81beed0" class="outline-2">
<h2 id="org81beed0"><span class="section-number-2">1</span> Setup</h2>
<div class="outline-text-2" id="text-1">
<p>
This trace is obtained QEMU simple tracing backend.  The guest is assigned 4
VCPUs, 8 GB memory, a virtio nic and a virtio block device.  The guest
runs Ubuntu 18.04.2 and is idle when the TCP migration is performed.
</p>

<p>
The trace events I used are provided in Appendix A.  The detailed
The trace events are in Appendix Atracing results are in Appendix B.
</p>
</div>
</div>
<div id="outline-container-org2f762c2" class="outline-2">
<h2 id="org2f762c2"><span class="section-number-2">2</span> Analysis</h2>
<div class="outline-text-2" id="text-2">
<p>
Operations sorted by time:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Index</th>
<th scope="col" class="org-left">Operations</th>
<th scope="col" class="org-right">Time (us)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">5</td>
<td class="org-left">send dirty RAM</td>
<td class="org-right">61805.705</td>
</tr>

<tr>
<td class="org-right">49</td>
<td class="org-left">save virtio-blk</td>
<td class="org-right">2030.198</td>
</tr>

<tr>
<td class="org-right">48</td>
<td class="org-left">save virtio-net</td>
<td class="org-right">2029.208</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">VM state change notify</td>
<td class="org-right">1083.087</td>
</tr>

<tr>
<td class="org-right">46</td>
<td class="org-left">save piix4<sub>pm</sub></td>
<td class="org-right">675.355</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">get dirty RAM log</td>
<td class="org-right">446.159</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">get CPU states from KVM</td>
<td class="org-right">421.595</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">save cpu</td>
<td class="org-right">297.233</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">stop all VCPUs</td>
<td class="org-right">221.704</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-left">save cpu</td>
<td class="org-right">173.444</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">save cpu</td>
<td class="org-right">172.909</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">save cpu</td>
<td class="org-right">166.661</td>
</tr>

<tr>
<td class="org-right">42</td>
<td class="org-left">save vmmouse</td>
<td class="org-right">133.532</td>
</tr>

<tr>
<td class="org-right">44</td>
<td class="org-left">save ide</td>
<td class="org-right">90.513</td>
</tr>

<tr>
<td class="org-right">51</td>
<td class="org-left">save globalstate</td>
<td class="org-right">64.848</td>
</tr>

<tr>
<td class="org-right">38</td>
<td class="org-left">save fdc</td>
<td class="org-right">62.999</td>
</tr>

<tr>
<td class="org-right">29</td>
<td class="org-left">save vga</td>
<td class="org-right">38.811</td>
</tr>

<tr>
<td class="org-right">26</td>
<td class="org-left">save i8259</td>
<td class="org-right">29.543</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">save kvm-tpr-opt</td>
<td class="org-right">27.977</td>
</tr>

<tr>
<td class="org-right">30</td>
<td class="org-left">save hpet</td>
<td class="org-right">24.44</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">save apic</td>
<td class="org-right">24.086</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">save slirp</td>
<td class="org-right">23.166</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">save apic</td>
<td class="org-right">21.979</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">save timer</td>
<td class="org-right">21.874</td>
</tr>

<tr>
<td class="org-right">32</td>
<td class="org-left">save i8254</td>
<td class="org-right">21.746</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-left">save apic</td>
<td class="org-right">21.214</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-left">save apic</td>
<td class="org-right">20.963</td>
</tr>

<tr>
<td class="org-right">31</td>
<td class="org-left">save mc146818rtc</td>
<td class="org-right">19.784</td>
</tr>

<tr>
<td class="org-right">34</td>
<td class="org-left">save dma</td>
<td class="org-right">18.103</td>
</tr>

<tr>
<td class="org-right">28</td>
<td class="org-left">save ioapic</td>
<td class="org-right">15.085</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-left">save dma</td>
<td class="org-right">14.851</td>
</tr>

<tr>
<td class="org-right">40</td>
<td class="org-left">save ps2mouse</td>
<td class="org-right">14.804</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">save PIIX3</td>
<td class="org-right">14.187</td>
</tr>

<tr>
<td class="org-right">27</td>
<td class="org-left">save i8259</td>
<td class="org-right">14.13</td>
</tr>

<tr>
<td class="org-right">39</td>
<td class="org-left">save ps2kbd</td>
<td class="org-right">13.944</td>
</tr>

<tr>
<td class="org-right">36</td>
<td class="org-left">save serial</td>
<td class="org-right">12.588</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">save <code>cpu_common</code></td>
<td class="org-right">11.444</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-left">save I440FX</td>
<td class="org-right">11.056</td>
</tr>

<tr>
<td class="org-right">21</td>
<td class="org-left">save kvmclock</td>
<td class="org-right">10.603</td>
</tr>

<tr>
<td class="org-right">37</td>
<td class="org-left">save <code>parallel_isa</code></td>
<td class="org-right">9.287</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-left">save <code>fw_cfg</code></td>
<td class="org-right">9.055</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-left">save PCIBUS</td>
<td class="org-right">8.083</td>
</tr>

<tr>
<td class="org-right">47</td>
<td class="org-left">save smbus-eeprom</td>
<td class="org-right">7.265</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-left">save pckbd</td>
<td class="org-right">7.067</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">save pcspk</td>
<td class="org-right">6.665</td>
</tr>

<tr>
<td class="org-right">50</td>
<td class="org-left">save acpi<sub>build</sub></td>
<td class="org-right">5.224</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-left">save i2c<sub>bus</sub></td>
<td class="org-right">4.938</td>
</tr>

<tr>
<td class="org-right">43</td>
<td class="org-left">save port92</td>
<td class="org-right">4.633</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">save <code>cpu_common~</code></td>
<td class="org-right">4.5</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">save <code>cpu_common</code></td>
<td class="org-right">4.242</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">save <code>cpu_common</code></td>
<td class="org-right">4.188</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>The time of RAM-related operations (get dirty log, send to remote)
may be reduced by
<ol class="org-ol">
<li>Enabling compression.  [TODO] will compression works for the
stop&amp;copy phase?</li>
<li>Setting max downtime limit.  This will affect the decision of
when to stop the iteration phase and to enter the final stop&amp;copy
phase.</li>
</ol></li>
<li>Saving some of the devices takes a lot time: is it due to network
transmission?</li>
<li>Most VM states can be saved/transmitted at round tens of
micro-seconds with a few exceptions that take thousands.</li>
</ul>
</div>
</div>
