posts/Virtualization/live migration stop&copy.org
* Appendix A: Probed tracing events
#+BEGIN_SRC
# part of savevm.c
qemu_loadvm_state_section
qemu_loadvm_state_section_command
qemu_loadvm_state_section_partend
qemu_loadvm_state_post_main
qemu_loadvm_state_section_startfull
qemu_savevm_send_packaged
loadvm_state_setup
loadvm_state_cleanup
savevm_command_send
savevm_section_start
savevm_section_end
savevm_section_skip
savevm_send_open_return_path
savevm_send_ping
savevm_send_postcopy_listen
savevm_send_postcopy_run
savevm_send_postcopy_resume
savevm_send_colo_enable
savevm_send_recv_bitmap
savevm_state_setup
savevm_state_resume_prepare
savevm_state_header
savevm_state_iterate
savevm_state_cleanup
savevm_state_complete_precopy
vmstate_save
vmstate_load
# migration.c
await_return_path_close_on_source_close
await_return_path_close_on_source_joining
migrate_set_state
migrate_fd_cleanup
migrate_fd_error
migrate_fd_cancel
migrate_handle_rp_req_pages
migrate_pending
migrate_send_rp_message
migrate_send_rp_recv_bitmap
migration_completion_file_err
migration_completion_postcopy_end
migration_completion_postcopy_end_after_complete
migration_return_path_end_before
migration_return_path_end_after
migration_thread_after_loop
migration_thread_file_err
migration_thread_ratelimit_pre
migration_thread_ratelimit_post
migration_thread_setup_complete
open_return_path_on_source
open_return_path_on_source_continue
postcopy_start
postcopy_pause_return_path
postcopy_pause_return_path_continued
postcopy_pause_continued
postcopy_start_set_run
source_return_path_thread_bad_end
source_return_path_thread_end
source_return_path_thread_entry
source_return_path_thread_loop_top
source_return_path_thread_pong
source_return_path_thread_shut
source_return_path_thread_resume_ack
migration_thread_low_pending
migrate_transferred
process_incoming_migration_co_end
process_incoming_migration_co_postcopy_end_main
# kvm-all.c
kvm_ioctl
kvm_vm_ioctl
kvm_vcpu_ioctl
kvm_run_exit
kvm_device_ioctl
kvm_failed_reg_get
kvm_failed_reg_set
kvm_irqchip_commit_routes
kvm_irqchip_add_msi_route
kvm_irqchip_update_msi_route
kvm_irqchip_release_virq
kvm_set_ioeventfd_mmio
kvm_set_ioeventfd_pio
kvm_set_user_memory
# ram.c
get_queued_page
get_queued_page_not_dirty
migration_bitmap_sync_start
migration_bitmap_sync_end
migration_throttle
multifd_recv
multifd_recv_sync_main
multifd_recv_sync_main_signal
multifd_recv_sync_main_wait
multifd_recv_thread_end
multifd_recv_thread_start
multifd_send
multifd_send_sync_main
multifd_send_sync_main_signal
multifd_send_sync_main_wait
multifd_send_thread_end
multifd_send_thread_start
ram_discard_range
ram_load_loop
ram_load_postcopy_loop
ram_postcopy_send_discard_bitmap
-ram_save_page
ram_save_queue_pages
ram_dirty_bitmap_request
ram_dirty_bitmap_reload_begin
ram_dirty_bitmap_reload_complete
ram_dirty_bitmap_sync_start
ram_dirty_bitmap_sync_wait
ram_dirty_bitmap_sync_complete
ram_state_resume_prepare
colo_flush_ram_cache_begin
colo_flush_ram_cache_end
save_xbzrle_page_skipping
save_xbzrle_page_overflow
ram_save_iterate_big_wait
ram_load_complete
# added
migration_completion_wakeup_request
migration_completion_globalstate_store
migration_completion_vm_stop
do_vm_stop_pause_all_vcpus_begin
do_vm_stop_pause_all_vcpus_end
net_vm_change_state_handler_begin
net_vm_change_state_handler_end
vm_state_notify_callback_begin
vm_state_notify_callback_end
bdrv_drain_all
replay_disable_events
bdrv_flush_all
#+END_SRC
* Appendix B: Tracing result
** stop all VCPUs: 221.704 us
#+BEGIN_EXAMPLE
migration_thread_low_pending,0.941,pending=0x846000
migration_completion_wakeup_request,1.166
migration_completion_globalstate_store,1.527
migration_completion_vm_stop,1.610
do_vm_stop_pause_all_vcpus_begin,162.782
do_vm_stop_pause_all_vcpus_end,53.678
#+END_EXAMPLE
** VM state change notify: 1083.087 us
#+BEGIN_EXAMPLE
vm_state_notify_callback_begin,0.784
vm_state_notify_callback_end,0.384
vm_state_notify_callback_begin,67.191
kvm_set_ioeventfd_mmio,0.780,fd=0x17,addr=0xfe007000,val=0x0,assign=0x0,size=0x0,datamatch=0x0
kvm_vm_ioctl,109.853,type=0x4040ae79,arg=0x7f20eeffc3d0
kvm_set_ioeventfd_pio,1.086,fd=0x17,addr=0xc010,val=0x0,assign=0x0,size=0x2,datamatch=0x1
kvm_vm_ioctl,58.903,type=0x4040ae79,arg=0x7f20eeffc3d0
kvm_vm_ioctl,37.582,type=0x4020ae76,arg=0x7f20eeffc5a0
kvm_irqchip_release_virq,12.129,virq=0x2
vm_state_notify_callback_end,0.859
vm_state_notify_callback_begin,105.248
kvm_set_ioeventfd_mmio,0.686,fd=0x13,addr=0xfe003000,val=0x0,assign=0x0,size=0x0,datamatch=0x0
kvm_vm_ioctl,67.815,type=0x4040ae79,arg=0x7f20eeffc570
kvm_set_ioeventfd_mmio,0.509,fd=0x14,addr=0xfe003004,val=0x1,assign=0x0,size=0x0,datamatch=0x0
kvm_vm_ioctl,58.957,type=0x4040ae79,arg=0x7f20eeffc570
kvm_set_ioeventfd_mmio,0.461,fd=0x15,addr=0xfe003008,val=0x2,assign=0x0,size=0x0,datamatch=0x0
kvm_vm_ioctl,59.775,type=0x4040ae79,arg=0x7f20eeffc570
kvm_set_ioeventfd_pio,0.519,fd=0x13,addr=0xc090,val=0x0,assign=0x0,size=0x2,datamatch=0x1
kvm_vm_ioctl,30.228,type=0x4040ae79,arg=0x7f20eeffc570
kvm_set_ioeventfd_pio,0.455,fd=0x14,addr=0xc090,val=0x1,assign=0x0,size=0x2,datamatch=0x1
kvm_vm_ioctl,29.808,type=0x4040ae79,arg=0x7f20eeffc570
kvm_set_ioeventfd_pio,0.477,fd=0x15,addr=0xc090,val=0x2,assign=0x0,size=0x2,datamatch=0x1
kvm_vm_ioctl,62.505,type=0x4040ae79,arg=0x7f20eeffc570
vm_state_notify_callback_end,0.444
vm_state_notify_callback_begin,0.592
vm_state_notify_callback_end,0.387
vm_state_notify_callback_begin,0.289
vm_state_notify_callback_end,0.396
vm_state_notify_callback_begin,5.211
kvm_vm_ioctl,3.454,type=0xffffffff8070ae9f,arg=0x7f20eeffc7e0
vm_state_notify_callback_end,0.423
vm_state_notify_callback_begin,0.880
kvm_ioctl,24.088,type=0xae03,arg=0x4c
kvm_vcpu_ioctl,69.623,cpu_index=0x0,type=0xffffffffc008ae88,arg=0x7f231e146910
kvm_vcpu_ioctl,118.076,cpu_index=0x1,type=0xffffffffc008ae88,arg=0x7f231d945910
kvm_vcpu_ioctl,61.232,cpu_index=0x2,type=0xffffffffc008ae88,arg=0x7f231d144910
kvm_vcpu_ioctl,18.657,cpu_index=0x3,type=0xffffffffc008ae88,arg=0x7f231c943910
kvm_vm_ioctl,2.548,type=0xffffffff8030ae7c,arg=0x7f20eeffc7c0
kvm_ioctl,2.033,type=0xae03,arg=0x27
vm_state_notify_callback_end,0.495
vm_state_notify_callback_begin,0.419
vm_state_notify_callback_end,0.605
vm_state_notify_callback_begin,0.304
vm_state_notify_callback_end,0.636
vm_state_notify_callback_begin,0.295
vm_state_notify_callback_end,0.453
vm_state_notify_callback_begin,0.300
vm_state_notify_callback_end,0.408
vm_state_notify_callback_begin,5.889
net_vm_change_state_handler_begin,6.247
net_vm_change_state_handler_end,0.353
vm_state_notify_callback_end,28.360
bdrv_drain_all,9.380
replay_disable_events,0.665
bdrv_flush_all,11.813
migration_completion_vm_stop_end,1.138
#+END_EXAMPLE
