posts/Virtualization/live migration stop&copy.html
<div id="outline-container-org2721755" class="outline-3">
<h3 id="org2721755"><span class="section-number-3">4.3</span> get CPU states from KVM: 421.595 us</h3>
<div class="outline-text-3" id="text-4-3">
<pre class="example">
savevm_state_complete_precopy,50.355
kvm_vcpu_ioctl,5.051,cpu_index=0x0,type=0xffffffff8040ae9f,arg=0x7f9d4bffe8b0
kvm_vcpu_ioctl,1.958,cpu_index=0x0,type=0xffffffff8004ae98,arg=0x7f9d4bffe8e0
kvm_vcpu_ioctl,3.627,cpu_index=0x0,type=0xffffffff8090ae81,arg=0x7f9d4bffe860
kvm_vcpu_ioctl,9.603,cpu_index=0x0,type=0xffffffff9000aea4,arg=0x7f9d40001000
kvm_vcpu_ioctl,2.171,cpu_index=0x0,type=0xffffffff8188aea6,arg=0x7f9d4bffe770
kvm_vcpu_ioctl,10.200,cpu_index=0x0,type=0xffffffff8138ae83,arg=0x7f9d4bffe7c0
kvm_vcpu_ioctl,17.757,cpu_index=0x0,type=0xffffffffc008ae88,arg=0x7f9d40002010
kvm_vcpu_ioctl,4.337,cpu_index=0x0,type=0xffffffff8400ae8e,arg=0x7f9d4bffe4f0
kvm_vcpu_ioctl,21.765,cpu_index=0x0,type=0xffffffff8080aea1,arg=0x7f9d4bffe870
kvm_vcpu_ioctl,4.798,cpu_index=0x1,type=0xffffffff8040ae9f,arg=0x7f9d4b7fd8b0
kvm_vcpu_ioctl,1.599,cpu_index=0x1,type=0xffffffff8004ae98,arg=0x7f9d4b7fd8e0
kvm_vcpu_ioctl,2.691,cpu_index=0x1,type=0xffffffff8090ae81,arg=0x7f9d4b7fd860
kvm_vcpu_ioctl,18.422,cpu_index=0x1,type=0xffffffff9000aea4,arg=0x7f9d38001000
kvm_vcpu_ioctl,1.706,cpu_index=0x1,type=0xffffffff8188aea6,arg=0x7f9d4b7fd770
kvm_vcpu_ioctl,10.941,cpu_index=0x1,type=0xffffffff8138ae83,arg=0x7f9d4b7fd7c0
kvm_vcpu_ioctl,17.931,cpu_index=0x1,type=0xffffffffc008ae88,arg=0x7f9d38002010
kvm_vcpu_ioctl,4.855,cpu_index=0x1,type=0xffffffff8400ae8e,arg=0x7f9d4b7fd4f0
kvm_vcpu_ioctl,52.697,cpu_index=0x1,type=0xffffffff8080aea1,arg=0x7f9d4b7fd870
kvm_vcpu_ioctl,4.643,cpu_index=0x2,type=0xffffffff8040ae9f,arg=0x7f9d4affc8b0
kvm_vcpu_ioctl,1.533,cpu_index=0x2,type=0xffffffff8004ae98,arg=0x7f9d4affc8e0
kvm_vcpu_ioctl,2.361,cpu_index=0x2,type=0xffffffff8090ae81,arg=0x7f9d4affc860
kvm_vcpu_ioctl,10.186,cpu_index=0x2,type=0xffffffff9000aea4,arg=0x7f9d3c001000
kvm_vcpu_ioctl,2.201,cpu_index=0x2,type=0xffffffff8188aea6,arg=0x7f9d4affc770
kvm_vcpu_ioctl,9.031,cpu_index=0x2,type=0xffffffff8138ae83,arg=0x7f9d4affc7c0
kvm_vcpu_ioctl,15.084,cpu_index=0x2,type=0xffffffffc008ae88,arg=0x7f9d3c002010
kvm_vcpu_ioctl,3.760,cpu_index=0x2,type=0xffffffff8400ae8e,arg=0x7f9d4affc4f0
kvm_vcpu_ioctl,65.921,cpu_index=0x2,type=0xffffffff8080aea1,arg=0x7f9d4affc870
kvm_vcpu_ioctl,4.538,cpu_index=0x3,type=0xffffffff8040ae9f,arg=0x7f9d4a7fb8b0
kvm_vcpu_ioctl,1.749,cpu_index=0x3,type=0xffffffff8004ae98,arg=0x7f9d4a7fb8e0
kvm_vcpu_ioctl,2.674,cpu_index=0x3,type=0xffffffff8090ae81,arg=0x7f9d4a7fb860
kvm_vcpu_ioctl,10.647,cpu_index=0x3,type=0xffffffff9000aea4,arg=0x7f9d30001000
kvm_vcpu_ioctl,2.155,cpu_index=0x3,type=0xffffffff8188aea6,arg=0x7f9d4a7fb770
kvm_vcpu_ioctl,10.440,cpu_index=0x3,type=0xffffffff8138ae83,arg=0x7f9d4a7fb7c0
kvm_vcpu_ioctl,16.436,cpu_index=0x3,type=0xffffffffc008ae88,arg=0x7f9d30002010
kvm_vcpu_ioctl,3.686,cpu_index=0x3,type=0xffffffff8400ae8e,arg=0x7f9d4a7fb4f0
kvm_vcpu_ioctl,12.086,cpu_index=0x3,type=0xffffffff8080aea1,arg=0x7f9d4a7fb870
</pre>
</div>
</div>
<div id="outline-container-org18169c6" class="outline-3">
<h3 id="org18169c6"><span class="section-number-3">4.4</span> get dirty RAM log: 446.159 us</h3>
<div class="outline-text-3" id="text-4-4">
<pre class="example">
savevm_section_start,16.060,id=ram,section_id=0x3
migration_bitmap_sync_start,2.003
kvm_vm_ioctl,3.496,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,1.290,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,1.145,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,1.162,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,1.138,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,5.840,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,51.467,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,2.099,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,7.014,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,87.759,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,1.546,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,1.080,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,1.396,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,1.061,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,1.163,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,4.468,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,50.213,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,2.030,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,6.769,type=0x4010ae42,arg=0x7f9b17ffe710
kvm_vm_ioctl,195.960,type=0x4010ae42,arg=0x7f9b17ffe710
</pre>
</div>
</div>
<div id="outline-container-orgd502fde" class="outline-3">
<h3 id="orgd502fde"><span class="section-number-3">4.5</span> send dirty RAM: 61805.705 us</h3>
<div class="outline-text-3" id="text-4-5">
<pre class="example">
migration_bitmap_sync_end,65885.705,dirty_pages=0x12f
savevm_section_end,14.236,id=ram,section_id=0x3,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orgba4633a" class="outline-3">
<h3 id="orgba4633a"><span class="section-number-3">4.6</span> save timer: 21.874 us</h3>
<div class="outline-text-3" id="text-4-6">
<pre class="example">
savevm_section_start,4.990,id=timer,section_id=0x0
vmstate_save,15.254,idstr=timer,vmsd_name=timer
savevm_section_end,1.630,id=timer,section_id=0x0,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org158809b" class="outline-3">
<h3 id="org158809b"><span class="section-number-3">4.7</span> save slirp: 23.166 us</h3>
<div class="outline-text-3" id="text-4-7">
<pre class="example">
savevm_section_start,3.103,id=slirp,section_id=0x1
vmstate_save,18.267,idstr=slirp,vmsd_name=(old)
savevm_section_end,1.796,id=slirp,section_id=0x1,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org1179ce6" class="outline-3">
<h3 id="org1179ce6"><span class="section-number-3">4.8</span> save <code>cpu_common</code>: 11.444 us</h3>
<div class="outline-text-3" id="text-4-8">
<pre class="example">
savevm_section_start,2.767,id=cpu_common,section_id=0x5
vmstate_save,7.020,idstr=cpu_common,vmsd_name=cpu_common
savevm_section_end,1.657,id=cpu_common,section_id=0x5,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org54bdbcb" class="outline-3">
<h3 id="org54bdbcb"><span class="section-number-3">4.9</span> save cpu: 297.233 us</h3>
<div class="outline-text-3" id="text-4-9">
<pre class="example">
savevm_section_start,2.716,id=cpu,section_id=0x6
vmstate_save,293.660,idstr=cpu,vmsd_name=cpu
savevm_section_end,0.857,id=cpu,section_id=0x6,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org16fbe21" class="outline-3">
<h3 id="org16fbe21"><span class="section-number-3">4.10</span> save kvm-tpr-opt: 27.977 us</h3>
<div class="outline-text-3" id="text-4-10">
<pre class="example">
savevm_section_start,1.404,id=kvm-tpr-opt,section_id=0x7
vmstate_save,25.820,idstr=kvm-tpr-opt,vmsd_name=kvm-tpr-opt
savevm_section_end,0.753,id=kvm-tpr-opt,section_id=0x7,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orgd8fbcaa" class="outline-3">
<h3 id="orgd8fbcaa"><span class="section-number-3">4.11</span> save apic: 24.086 us</h3>
<div class="outline-text-3" id="text-4-11">
<pre class="example">
savevm_section_start,1.174,id=apic,section_id=0x8
vmstate_save,22.219,idstr=apic,vmsd_name=apic
savevm_section_end,0.693,id=apic,section_id=0x8,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org2882a65" class="outline-3">
<h3 id="org2882a65"><span class="section-number-3">4.12</span> save <code>cpu_common~</code>: 4.5 us</h3>
<div class="outline-text-3" id="text-4-12">
<pre class="example">
savevm_section_start,1.169,id=cpu_common,section_id=0x9
vmstate_save,2.631,idstr=cpu_common,vmsd_name=cpu_common
savevm_section_end,0.700,id=cpu_common,section_id=0x9,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org8e8b170" class="outline-3">
<h3 id="org8e8b170"><span class="section-number-3">4.13</span> save cpu: 172.909 us</h3>
<div class="outline-text-3" id="text-4-13">
<pre class="example">
savevm_section_start,1.026,id=cpu,section_id=0xa
vmstate_save,171.215,idstr=cpu,vmsd_name=cpu
savevm_section_end,0.668,id=cpu,section_id=0xa,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org62352b9" class="outline-3">
<h3 id="org62352b9"><span class="section-number-3">4.14</span> save apic: 21.979 us</h3>
<div class="outline-text-3" id="text-4-14">
<pre class="example">
savevm_section_start,1.215,id=apic,section_id=0xb
vmstate_save,20.155,idstr=apic,vmsd_name=apic
savevm_section_end,0.609,id=apic,section_id=0xb,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orgcc9f035" class="outline-3">
<h3 id="orgcc9f035"><span class="section-number-3">4.15</span> save <code>cpu_common</code>: 4.188 us</h3>
<div class="outline-text-3" id="text-4-15">
<pre class="example">
savevm_section_start,1.107,id=cpu_common,section_id=0xc
vmstate_save,2.402,idstr=cpu_common,vmsd_name=cpu_common
savevm_section_end,0.679,id=cpu_common,section_id=0xc,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org237ec35" class="outline-3">
<h3 id="org237ec35"><span class="section-number-3">4.16</span> save cpu: 166.661 us</h3>
<div class="outline-text-3" id="text-4-16">
<pre class="example">
savevm_section_start,1.095,id=cpu,section_id=0xd
vmstate_save,164.865,idstr=cpu,vmsd_name=cpu
savevm_section_end,0.701,id=cpu,section_id=0xd,ret=0x0
</pre>
</div>
</div>
