posts/Virtualization/live migration stop&copy.html
<div id="outline-container-orgf76dee7" class="outline-3">
<h3 id="orgf76dee7"><span class="section-number-3">4.17</span> save apic: 21.214 us</h3>
<div class="outline-text-3" id="text-4-17">
<pre class="example">
savevm_section_start,0.989,id=apic,section_id=0xe
vmstate_save,19.582,idstr=apic,vmsd_name=apic
savevm_section_end,0.643,id=apic,section_id=0xe,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org96375c4" class="outline-3">
<h3 id="org96375c4"><span class="section-number-3">4.18</span> save <code>cpu_common</code>: 4.242 us</h3>
<div class="outline-text-3" id="text-4-18">
<pre class="example">
savevm_section_start,1.073,id=cpu_common,section_id=0xf
vmstate_save,2.407,idstr=cpu_common,vmsd_name=cpu_common
savevm_section_end,0.762,id=cpu_common,section_id=0xf,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org0ffb594" class="outline-3">
<h3 id="org0ffb594"><span class="section-number-3">4.19</span> save cpu: 173.444 us</h3>
<div class="outline-text-3" id="text-4-19">
<pre class="example">
savevm_section_start,1.352,id=cpu,section_id=0x10
vmstate_save,171.059,idstr=cpu,vmsd_name=cpu
savevm_section_end,1.033,id=cpu,section_id=0x10,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orgea40b95" class="outline-3">
<h3 id="orgea40b95"><span class="section-number-3">4.20</span> save apic: 20.963 us</h3>
<div class="outline-text-3" id="text-4-20">
<pre class="example">
savevm_section_start,1.119,id=apic,section_id=0x11
vmstate_save,19.160,idstr=apic,vmsd_name=apic
savevm_section_end,0.684,id=apic,section_id=0x11,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orge7f0853" class="outline-3">
<h3 id="orge7f0853"><span class="section-number-3">4.21</span> save kvmclock: 10.603 us</h3>
<div class="outline-text-3" id="text-4-21">
<pre class="example">
savevm_section_start,1.361,id=kvmclock,section_id=0x12
vmstate_save,1.028,idstr=kvmclock,vmsd_name=kvmclock
kvm_vm_ioctl,1.917,type=0xffffffff8030ae7c,arg=0x7f9b17ffe770
kvm_ioctl,5.534,type=0xae03,arg=0x27
savevm_section_end,0.763,id=kvmclock,section_id=0x12,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org6c8f1cf" class="outline-3">
<h3 id="org6c8f1cf"><span class="section-number-3">4.22</span> save <code>fw_cfg</code>: 9.055 us</h3>
<div class="outline-text-3" id="text-4-22">
<pre class="example">
savevm_section_start,1.208,id=fw_cfg,section_id=0x13
vmstate_save,7.135,idstr=fw_cfg,vmsd_name=fw_cfg
savevm_section_end,0.712,id=fw_cfg,section_id=0x13,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org1ebc1a7" class="outline-3">
<h3 id="org1ebc1a7"><span class="section-number-3">4.23</span> save PCIBUS: 8.083 us</h3>
<div class="outline-text-3" id="text-4-23">
<pre class="example">
savevm_section_start,1.214,id=PCIBUS,section_id=0x14
vmstate_save,6.160,idstr=PCIBUS,vmsd_name=PCIBUS
savevm_section_end,0.709,id=PCIBUS,section_id=0x14,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org30846ba" class="outline-3">
<h3 id="org30846ba"><span class="section-number-3">4.24</span> save I440FX: 11.056 us</h3>
<div class="outline-text-3" id="text-4-24">
<pre class="example">
savevm_section_start,1.307,id=0000:00:00.0/I440FX,section_id=0x15
vmstate_save,8.973,idstr=0000:00:00.0/I440FX,vmsd_name=I440FX
savevm_section_end,0.776,id=0000:00:00.0/I440FX,section_id=0x15,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orgf320a51" class="outline-3">
<h3 id="orgf320a51"><span class="section-number-3">4.25</span> save PIIX3: 14.187 us</h3>
<div class="outline-text-3" id="text-4-25">
<pre class="example">
savevm_section_start,1.531,id=0000:00:01.0/PIIX3,section_id=0x16
vmstate_save,11.752,idstr=0000:00:01.0/PIIX3,vmsd_name=PIIX3
savevm_section_end,0.904,id=0000:00:01.0/PIIX3,section_id=0x16,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org7aedad0" class="outline-3">
<h3 id="org7aedad0"><span class="section-number-3">4.26</span> save i8259: 29.543 us</h3>
<div class="outline-text-3" id="text-4-26">
<pre class="example">
savevm_section_start,1.325,id=i8259,section_id=0x17
vmstate_save,7.737,idstr=i8259,vmsd_name=i8259
kvm_vm_ioctl,19.740,type=0xffffffffc208ae62,arg=0x7f9b17ffe5a0
savevm_section_end,0.741,id=i8259,section_id=0x17,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org55d7de5" class="outline-3">
<h3 id="org55d7de5"><span class="section-number-3">4.27</span> save i8259: 14.13 us</h3>
<div class="outline-text-3" id="text-4-27">
<pre class="example">
savevm_section_start,1.077,id=i8259,section_id=0x18
vmstate_save,0.724,idstr=i8259,vmsd_name=i8259
kvm_vm_ioctl,11.598,type=0xffffffffc208ae62,arg=0x7f9b17ffe5a0
savevm_section_end,0.731,id=i8259,section_id=0x18,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org28a2781" class="outline-3">
<h3 id="org28a2781"><span class="section-number-3">4.28</span> save ioapic: 15.085 us</h3>
<div class="outline-text-3" id="text-4-28">
<pre class="example">
savevm_section_start,1.080,id=ioapic,section_id=0x19
vmstate_save,2.504,idstr=ioapic,vmsd_name=ioapic
kvm_vm_ioctl,10.847,type=0xffffffffc208ae62,arg=0x7f9b17ffe5a0
savevm_section_end,0.654,id=ioapic,section_id=0x19,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orgfd268eb" class="outline-3">
<h3 id="orgfd268eb"><span class="section-number-3">4.29</span> save vga: 38.811 us</h3>
<div class="outline-text-3" id="text-4-29">
<pre class="example">
savevm_section_start,1.339,id=0000:00:02.0/vga,section_id=0x1a
vmstate_save,36.624,idstr=0000:00:02.0/vga,vmsd_name=vga
savevm_section_end,0.848,id=0000:00:02.0/vga,section_id=0x1a,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org0977d82" class="outline-3">
<h3 id="org0977d82"><span class="section-number-3">4.30</span> save hpet: 24.44 us</h3>
<div class="outline-text-3" id="text-4-30">
<pre class="example">
savevm_section_start,1.358,id=hpet,section_id=0x1b
vmstate_save,22.326,idstr=hpet,vmsd_name=hpet
savevm_section_end,0.756,id=hpet,section_id=0x1b,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org9bb56cc" class="outline-3">
<h3 id="org9bb56cc"><span class="section-number-3">4.31</span> save mc146818rtc: 19.784 us</h3>
<div class="outline-text-3" id="text-4-31">
<pre class="example">
savevm_section_start,1.246,id=mc146818rtc,section_id=0x1c
vmstate_save,16.786,idstr=mc146818rtc,vmsd_name=mc146818rtc
savevm_section_end,1.752,id=mc146818rtc,section_id=0x1c,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orgb466961" class="outline-3">
<h3 id="orgb466961"><span class="section-number-3">4.32</span> save i8254: 21.746 us</h3>
<div class="outline-text-3" id="text-4-32">
<pre class="example">
savevm_section_start,1.299,id=i8254,section_id=0x1d
vmstate_save,19.428,idstr=i8254,vmsd_name=i8254
savevm_section_end,1.019,id=i8254,section_id=0x1d,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org318e89b" class="outline-3">
<h3 id="org318e89b"><span class="section-number-3">4.33</span> save pcspk: 6.665 us</h3>
<div class="outline-text-3" id="text-4-33">
<pre class="example">
savevm_section_start,2.670,id=pcspk,section_id=0x1e
vmstate_save,3.218,idstr=pcspk,vmsd_name=pcspk
savevm_section_end,0.777,id=pcspk,section_id=0x1e,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org8a85051" class="outline-3">
<h3 id="org8a85051"><span class="section-number-3">4.34</span> save dma: 18.103 us</h3>
<div class="outline-text-3" id="text-4-34">
<pre class="example">
savevm_section_start,1.182,id=dma,section_id=0x1f
vmstate_save,16.347,idstr=dma,vmsd_name=dma
savevm_section_end,0.574,id=dma,section_id=0x1f,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org994b792" class="outline-3">
<h3 id="org994b792"><span class="section-number-3">4.35</span> save dma: 14.851 us</h3>
<div class="outline-text-3" id="text-4-35">
<pre class="example">
savevm_section_start,1.116,id=dma,section_id=0x20
vmstate_save,13.131,idstr=dma,vmsd_name=dma
savevm_section_end,0.604,id=dma,section_id=0x20,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org28148cc" class="outline-3">
<h3 id="org28148cc"><span class="section-number-3">4.36</span> save serial: 12.588 us</h3>
<div class="outline-text-3" id="text-4-36">
<pre class="example">
savevm_section_start,1.278,id=serial,section_id=0x21
vmstate_save,10.526,idstr=serial,vmsd_name=serial
savevm_section_end,0.784,id=serial,section_id=0x21,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org64482bc" class="outline-3">
<h3 id="org64482bc"><span class="section-number-3">4.37</span> save <code>parallel_isa</code>: 9.287 us</h3>
<div class="outline-text-3" id="text-4-37">
<pre class="example">
savevm_section_start,1.223,id=parallel_isa,section_id=0x22
vmstate_save,7.385,idstr=parallel_isa,vmsd_name=parallel_isa
savevm_section_end,0.679,id=parallel_isa,section_id=0x22,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org4512787" class="outline-3">
<h3 id="org4512787"><span class="section-number-3">4.38</span> save fdc: 62.999 us</h3>
<div class="outline-text-3" id="text-4-38">
<pre class="example">
savevm_section_start,1.167,id=fdc,section_id=0x23
vmstate_save,61.082,idstr=fdc,vmsd_name=fdc
savevm_section_end,0.750,id=fdc,section_id=0x23,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org3023517" class="outline-3">
<h3 id="org3023517"><span class="section-number-3">4.39</span> save ps2kbd: 13.944 us</h3>
<div class="outline-text-3" id="text-4-39">
<pre class="example">
savevm_section_start,1.227,id=ps2kbd,section_id=0x24
vmstate_save,11.975,idstr=ps2kbd,vmsd_name=ps2kbd
savevm_section_end,0.742,id=ps2kbd,section_id=0x24,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org540d533" class="outline-3">
<h3 id="org540d533"><span class="section-number-3">4.40</span> save ps2mouse: 14.804 us</h3>
<div class="outline-text-3" id="text-4-40">
<pre class="example">
savevm_section_start,1.262,id=ps2mouse,section_id=0x25
vmstate_save,12.995,idstr=ps2mouse,vmsd_name=ps2mouse
savevm_section_end,0.547,id=ps2mouse,section_id=0x25,ret=0x0
</pre>
</div>
</div>
