posts/Virtualization/live migration stop&copy.org
** save pckbd: 7.067 us
#+BEGIN_EXAMPLE
savevm_section_start,1.305,id=pckbd,section_id=0x26
vmstate_save,5.212,idstr=pckbd,vmsd_name=pckbd
savevm_section_end,0.550,id=pckbd,section_id=0x26,ret=0x0
#+END_EXAMPLE
** save vmmouse: 133.532 us
#+BEGIN_EXAMPLE
savevm_section_start,1.190,id=vmmouse,section_id=0x27
vmstate_save,131.630,idstr=vmmouse,vmsd_name=vmmouse
savevm_section_end,0.712,id=vmmouse,section_id=0x27,ret=0x0
#+END_EXAMPLE
** save port92: 4.633 us
#+BEGIN_EXAMPLE
savevm_section_start,1.263,id=port92,section_id=0x28
vmstate_save,2.650,idstr=port92,vmsd_name=port92
savevm_section_end,0.720,id=port92,section_id=0x28,ret=0x0
#+END_EXAMPLE
** save ide: 90.513 us
#+BEGIN_EXAMPLE
savevm_section_start,1.288,id=0000:00:01.1/ide,section_id=0x29
vmstate_save,88.492,idstr=0000:00:01.1/ide,vmsd_name=ide
savevm_section_end,0.733,id=0000:00:01.1/ide,section_id=0x29,ret=0x0
#+END_EXAMPLE
** save i2c_bus: 4.938 us
#+BEGIN_EXAMPLE
savevm_section_start,1.243,id=i2c_bus,section_id=0x2a
vmstate_save,3.008,idstr=i2c_bus,vmsd_name=i2c_bus
savevm_section_end,0.687,id=i2c_bus,section_id=0x2a,ret=0x0
#+END_EXAMPLE
** save piix4_pm: 675.355 us
#+BEGIN_EXAMPLE
savevm_section_start,1.469,id=0000:00:01.3/piix4_pm,section_id=0x2b
vmstate_save,672.004,idstr=0000:00:01.3/piix4_pm,vmsd_name=piix4_pm
savevm_section_end,1.882,id=0000:00:01.3/piix4_pm,section_id=0x2b,ret=0x0
#+END_EXAMPLE
** save smbus-eeprom: 7.265 us
#+BEGIN_EXAMPLE
savevm_section_skip,1.785,id=smbus-eeprom,section_id=0x2c
savevm_section_skip,1.732,id=smbus-eeprom,section_id=0x2d
savevm_section_skip,0.701,id=smbus-eeprom,section_id=0x2e
savevm_section_skip,0.525,id=smbus-eeprom,section_id=0x2f
savevm_section_skip,0.652,id=smbus-eeprom,section_id=0x30
savevm_section_skip,0.667,id=smbus-eeprom,section_id=0x31
savevm_section_skip,0.626,id=smbus-eeprom,section_id=0x32
savevm_section_skip,0.577,id=smbus-eeprom,section_id=0x33
#+END_EXAMPLE
** save virtio-net: 2029.208 us
#+BEGIN_EXAMPLE
savevm_section_start,1.649,id=0000:00:03.0/virtio-net,section_id=0x34
vmstate_save,2026.624,idstr=0000:00:03.0/virtio-net,vmsd_name=virtio-net
savevm_section_end,0.935,id=0000:00:03.0/virtio-net,section_id=0x34,ret=0x0
#+END_EXAMPLE
** save virtio-blk: 2030.198 us
#+BEGIN_EXAMPLE
savevm_section_start,1.429,id=0000:00:04.0/virtio-blk,section_id=0x35
vmstate_save,2027.904,idstr=0000:00:04.0/virtio-blk,vmsd_name=virtio-blk
savevm_section_end,0.865,id=0000:00:04.0/virtio-blk,section_id=0x35,ret=0x0
#+END_EXAMPLE
** save acpi_build: 5.224 us
#+BEGIN_EXAMPLE
savevm_section_start,1.415,id=acpi_build,section_id=0x36
vmstate_save,3.242,idstr=acpi_build,vmsd_name=acpi_build
savevm_section_end,0.567,id=acpi_build,section_id=0x36,ret=0x0
#+END_EXAMPLE
** save globalstate: 64.848 us
#+BEGIN_EXAMPLE
savevm_section_start,1.040,id=globalstate,section_id=0x37
vmstate_save,3.256,idstr=globalstate,vmsd_name=globalstate
savevm_section_end,60.552,id=globalstate,section_id=0x37,ret=0x0
#+END_EXAMPLE
