posts/Virtualization/live migration stop&copy.html
<div id="outline-container-orgaa93238" class="outline-3">
<h3 id="orgaa93238"><span class="section-number-3">4.41</span> save pckbd: 7.067 us</h3>
<div class="outline-text-3" id="text-4-41">
<pre class="example">
savevm_section_start,1.305,id=pckbd,section_id=0x26
vmstate_save,5.212,idstr=pckbd,vmsd_name=pckbd
savevm_section_end,0.550,id=pckbd,section_id=0x26,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orgdaf4433" class="outline-3">
<h3 id="orgdaf4433"><span class="section-number-3">4.42</span> save vmmouse: 133.532 us</h3>
<div class="outline-text-3" id="text-4-42">
<pre class="example">
savevm_section_start,1.190,id=vmmouse,section_id=0x27
vmstate_save,131.630,idstr=vmmouse,vmsd_name=vmmouse
savevm_section_end,0.712,id=vmmouse,section_id=0x27,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org6136075" class="outline-3">
<h3 id="org6136075"><span class="section-number-3">4.43</span> save port92: 4.633 us</h3>
<div class="outline-text-3" id="text-4-43">
<pre class="example">
savevm_section_start,1.263,id=port92,section_id=0x28
vmstate_save,2.650,idstr=port92,vmsd_name=port92
savevm_section_end,0.720,id=port92,section_id=0x28,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org94afdb6" class="outline-3">
<h3 id="org94afdb6"><span class="section-number-3">4.44</span> save ide: 90.513 us</h3>
<div class="outline-text-3" id="text-4-44">
<pre class="example">
savevm_section_start,1.288,id=0000:00:01.1/ide,section_id=0x29
vmstate_save,88.492,idstr=0000:00:01.1/ide,vmsd_name=ide
savevm_section_end,0.733,id=0000:00:01.1/ide,section_id=0x29,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org0f367f5" class="outline-3">
<h3 id="org0f367f5"><span class="section-number-3">4.45</span> save i2c<sub>bus</sub>: 4.938 us</h3>
<div class="outline-text-3" id="text-4-45">
<pre class="example">
savevm_section_start,1.243,id=i2c_bus,section_id=0x2a
vmstate_save,3.008,idstr=i2c_bus,vmsd_name=i2c_bus
savevm_section_end,0.687,id=i2c_bus,section_id=0x2a,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org79b80cc" class="outline-3">
<h3 id="org79b80cc"><span class="section-number-3">4.46</span> save piix4<sub>pm</sub>: 675.355 us</h3>
<div class="outline-text-3" id="text-4-46">
<pre class="example">
savevm_section_start,1.469,id=0000:00:01.3/piix4_pm,section_id=0x2b
vmstate_save,672.004,idstr=0000:00:01.3/piix4_pm,vmsd_name=piix4_pm
savevm_section_end,1.882,id=0000:00:01.3/piix4_pm,section_id=0x2b,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orga03e1c5" class="outline-3">
<h3 id="orga03e1c5"><span class="section-number-3">4.47</span> save smbus-eeprom: 7.265 us</h3>
<div class="outline-text-3" id="text-4-47">
<pre class="example">
savevm_section_skip,1.785,id=smbus-eeprom,section_id=0x2c
savevm_section_skip,1.732,id=smbus-eeprom,section_id=0x2d
savevm_section_skip,0.701,id=smbus-eeprom,section_id=0x2e
savevm_section_skip,0.525,id=smbus-eeprom,section_id=0x2f
savevm_section_skip,0.652,id=smbus-eeprom,section_id=0x30
savevm_section_skip,0.667,id=smbus-eeprom,section_id=0x31
savevm_section_skip,0.626,id=smbus-eeprom,section_id=0x32
savevm_section_skip,0.577,id=smbus-eeprom,section_id=0x33
</pre>
</div>
</div>
<div id="outline-container-orgbf3b6ca" class="outline-3">
<h3 id="orgbf3b6ca"><span class="section-number-3">4.48</span> save virtio-net: 2029.208 us</h3>
<div class="outline-text-3" id="text-4-48">
<pre class="example">
savevm_section_start,1.649,id=0000:00:03.0/virtio-net,section_id=0x34
vmstate_save,2026.624,idstr=0000:00:03.0/virtio-net,vmsd_name=virtio-net
savevm_section_end,0.935,id=0000:00:03.0/virtio-net,section_id=0x34,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org8da83cb" class="outline-3">
<h3 id="org8da83cb"><span class="section-number-3">4.49</span> save virtio-blk: 2030.198 us</h3>
<div class="outline-text-3" id="text-4-49">
<pre class="example">
savevm_section_start,1.429,id=0000:00:04.0/virtio-blk,section_id=0x35
vmstate_save,2027.904,idstr=0000:00:04.0/virtio-blk,vmsd_name=virtio-blk
savevm_section_end,0.865,id=0000:00:04.0/virtio-blk,section_id=0x35,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-orgc0905c5" class="outline-3">
<h3 id="orgc0905c5"><span class="section-number-3">4.50</span> save acpi<sub>build</sub>: 5.224 us</h3>
<div class="outline-text-3" id="text-4-50">
<pre class="example">
savevm_section_start,1.415,id=acpi_build,section_id=0x36
vmstate_save,3.242,idstr=acpi_build,vmsd_name=acpi_build
savevm_section_end,0.567,id=acpi_build,section_id=0x36,ret=0x0
</pre>
</div>
</div>
<div id="outline-container-org4070468" class="outline-3">
<h3 id="org4070468"><span class="section-number-3">4.51</span> save globalstate: 64.848 us</h3>
<div class="outline-text-3" id="text-4-51">
<pre class="example">
savevm_section_start,1.040,id=globalstate,section_id=0x37
vmstate_save,3.256,idstr=globalstate,vmsd_name=globalstate
savevm_section_end,60.552,id=globalstate,section_id=0x37,ret=0x0
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Jul 16, 2019</p>
<p class="validation"></p>
</div>
</body>
</html>
